In [1]:
# Dependencies
import pandas as pd
import numpy as np

In [2]:
# Store filepath in a variable
enrolment_data = "../Data/enrolment_data.xlsx"

In [41]:
# Read data file with pandas library (specifying the relevant worksheet within the excel file)
# skiprows as first 5 rows of worksheet are irrelevant for purpose of the project
enrolment_df = pd.read_excel(enrolment_data, '2004-2020', skiprows=5)

In [42]:
# Clean worksheet
# Delete unnecessary rows
enrolment_df = enrolment_df.drop(enrolment_df.index[0:3])
enrolment_df = enrolment_df.drop(enrolment_df.index[8:16000])
enrolment_df

,Unnamed: 0,2004,2005,2006,2007,2008,2009,2010,2011,2012,...,Unnamed: 16374,Unnamed: 16375,Unnamed: 16376,Unnamed: 16377,Unnamed: 16378,Unnamed: 16379,Unnamed: 16380,Unnamed: 16381,Unnamed: 16382,Unnamed: 16383
3,NSW,777.7,784.4,784.4,785.6,800.5,862.1,926.8,946.0,952.2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Vic.,626,591.2,575.7,606.2,661,669.1,723.4,731.3,726.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,Qld,429.3,436.6,429,462.8,479,479,515.2,538.3,520.3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,SA,162,170.5,166.2,175.1,184.2,183,198.0,202.5,205.6,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,WA,224.7,213.1,204.9,223.7,213.8,242.8,252.0,264.2,275.9,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,Tas.,50.8,54.2,52.1,54.1,59.9,58.3,55.0,62.1,60.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NT,14.2,16.2,19.7,12.8,17.8,22.6,26.6,19.5,22.6,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,ACT,48.5,52.7,47.1,51.8,50.9,54.7,58.1,56.8,57.2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [43]:
# Delete unneccesary columns
enrolment_df.dropna(axis=1, how='any', inplace=True)
enrolment_df

,Unnamed: 0,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
3,NSW,777.7,784.4,784.4,785.6,800.5,862.1,926.8,946.0,952.2,938.3,959.2,936.9,1000.1,976.6,983.1,1021.9,1029.7
4,Vic.,626,591.2,575.7,606.2,661,669.1,723.4,731.3,726.5,741.2,759.2,807.1,797.8,786.8,842.8,875.4,849.5
5,Qld,429.3,436.6,429,462.8,479,479,515.2,538.3,520.3,567.6,545.1,568.2,601.5,571.7,580.9,594.8,604.7
6,SA,162,170.5,166.2,175.1,184.2,183,198.0,202.5,205.6,221.7,216.1,227.1,220.0,208.7,212.6,207.8,194.9
7,WA,224.7,213.1,204.9,223.7,213.8,242.8,252.0,264.2,275.9,281.3,296.3,307.7,315.1,309.7,303.6,311.2,299.9
8,Tas.,50.8,54.2,52.1,54.1,59.9,58.3,55.0,62.1,60.5,64.2,59.8,61.0,59.2,57.5,58.9,60.7,61.8
9,NT,14.2,16.2,19.7,12.8,17.8,22.6,26.6,19.5,22.6,25.2,28.6,30.6,29.2,28.4,26.1,23.7,26.0
10,ACT,48.5,52.7,47.1,51.8,50.9,54.7,58.1,56.8,57.2,56.5,64.7,59.3,62.6,63.2,71.4,61.7,59.1

In [44]:
# Rename region column
enrolment_df = enrolment_df.rename(columns={'Unnamed: 0':'Region'})
enrolment_df

,Region,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
3,NSW,777.7,784.4,784.4,785.6,800.5,862.1,926.8,946.0,952.2,938.3,959.2,936.9,1000.1,976.6,983.1,1021.9,1029.7
4,Vic.,626,591.2,575.7,606.2,661,669.1,723.4,731.3,726.5,741.2,759.2,807.1,797.8,786.8,842.8,875.4,849.5
5,Qld,429.3,436.6,429,462.8,479,479,515.2,538.3,520.3,567.6,545.1,568.2,601.5,571.7,580.9,594.8,604.7
6,SA,162,170.5,166.2,175.1,184.2,183,198.0,202.5,205.6,221.7,216.1,227.1,220.0,208.7,212.6,207.8,194.9
7,WA,224.7,213.1,204.9,223.7,213.8,242.8,252.0,264.2,275.9,281.3,296.3,307.7,315.1,309.7,303.6,311.2,299.9
8,Tas.,50.8,54.2,52.1,54.1,59.9,58.3,55.0,62.1,60.5,64.2,59.8,61.0,59.2,57.5,58.9,60.7,61.8
9,NT,14.2,16.2,19.7,12.8,17.8,22.6,26.6,19.5,22.6,25.2,28.6,30.6,29.2,28.4,26.1,23.7,26.0
10,ACT,48.5,52.7,47.1,51.8,50.9,54.7,58.1,56.8,57.2,56.5,64.7,59.3,62.6,63.2,71.4,61.7,59.1

In [45]:
# Rename VIC, QLD and TAS to ensure compatibility with migration data
enrolment_df.loc[4,'Region'] = 'VIC'
enrolment_df.loc[5,'Region'] = 'QLD'
enrolment_df.loc[8,'Region'] = 'TAS'
enrolment_df

,Region,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
3,NSW,777.7,784.4,784.4,785.6,800.5,862.1,926.8,946.0,952.2,938.3,959.2,936.9,1000.1,976.6,983.1,1021.9,1029.7
4,VIC,626,591.2,575.7,606.2,661,669.1,723.4,731.3,726.5,741.2,759.2,807.1,797.8,786.8,842.8,875.4,849.5
5,QLD,429.3,436.6,429,462.8,479,479,515.2,538.3,520.3,567.6,545.1,568.2,601.5,571.7,580.9,594.8,604.7
6,SA,162,170.5,166.2,175.1,184.2,183,198.0,202.5,205.6,221.7,216.1,227.1,220.0,208.7,212.6,207.8,194.9
7,WA,224.7,213.1,204.9,223.7,213.8,242.8,252.0,264.2,275.9,281.3,296.3,307.7,315.1,309.7,303.6,311.2,299.9
8,TAS,50.8,54.2,52.1,54.1,59.9,58.3,55.0,62.1,60.5,64.2,59.8,61.0,59.2,57.5,58.9,60.7,61.8
9,NT,14.2,16.2,19.7,12.8,17.8,22.6,26.6,19.5,22.6,25.2,28.6,30.6,29.2,28.4,26.1,23.7,26.0
10,ACT,48.5,52.7,47.1,51.8,50.9,54.7,58.1,56.8,57.2,56.5,64.7,59.3,62.6,63.2,71.4,61.7,59.1

In [46]:
# Reshape data from wide to long
idx = ['Region']

multi_indexed_df = enrolment_df.set_index(idx)

multi_indexed_df

,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
Region,,,,,,,,,,,,,,,,,
NSW,777.7,784.4,784.4,785.6,800.5,862.1,926.8,946.0,952.2,938.3,959.2,936.9,1000.1,976.6,983.1,1021.9,1029.7
VIC,626,591.2,575.7,606.2,661,669.1,723.4,731.3,726.5,741.2,759.2,807.1,797.8,786.8,842.8,875.4,849.5
QLD,429.3,436.6,429,462.8,479,479,515.2,538.3,520.3,567.6,545.1,568.2,601.5,571.7,580.9,594.8,604.7
SA,162,170.5,166.2,175.1,184.2,183,198.0,202.5,205.6,221.7,216.1,227.1,220.0,208.7,212.6,207.8,194.9
WA,224.7,213.1,204.9,223.7,213.8,242.8,252.0,264.2,275.9,281.3,296.3,307.7,315.1,309.7,303.6,311.2,299.9
TAS,50.8,54.2,52.1,54.1,59.9,58.3,55.0,62.1,60.5,64.2,59.8,61.0,59.2,57.5,58.9,60.7,61.8
NT,14.2,16.2,19.7,12.8,17.8,22.6,26.6,19.5,22.6,25.2,28.6,30.6,29.2,28.4,26.1,23.7,26.0
ACT,48.5,52.7,47.1,51.8,50.9,54.7,58.1,56.8,57.2,56.5,64.7,59.3,62.6,63.2,71.4,61.7,59.1

In [47]:
# Stack data
stacked_df = multi_indexed_df.stack(dropna=False)

In [48]:
stacked_df

Region
NSW     2004    777.7
        2005    784.4
        2006    784.4
        2007    785.6
        2008    800.5
                ...
ACT     2016     62.6
        2017     63.2
        2018     71.4
        2019     61.7
        2020     59.1
Length: 136, dtype: object

In [49]:
# Reset index to disband the multi-level index
final_enrolment_df = stacked_df.reset_index()

In [50]:
final_enrolment_df

    Region  level_1      0
0      NSW     2004  777.7
1      NSW     2005  784.4
2      NSW     2006  784.4
3      NSW     2007  785.6
4      NSW     2008  800.5
..     ...      ...    ...
131    ACT     2016   62.6
132    ACT     2017   63.2
133    ACT     2018   71.4
134    ACT     2019   61.7
135    ACT     2020   59.1

[136 rows x 3 columns]

In [51]:
final_enrolment_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 136 entries, 0 to 135
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Region   136 non-null    object
 1   level_1  136 non-null    int64
 2   0        136 non-null    object
dtypes: int64(1), object(2)
memory usage: 3.3+ KB

In [52]:
# Rename columns
final_enrolment_df = final_enrolment_df.rename(columns={'level_1':'Year',0:'Num_Enrolled'})
final_enrolment_df

    Region  Year Num_Enrolled
0      NSW  2004        777.7
1      NSW  2005        784.4
2      NSW  2006        784.4
3      NSW  2007        785.6
4      NSW  2008        800.5
..     ...   ...          ...
131    ACT  2016         62.6
132    ACT  2017         63.2
133    ACT  2018         71.4
134    ACT  2019         61.7
135    ACT  2020         59.1

[136 rows x 3 columns]

In [53]:
# Change Num_Enrolled column from object to numeric
final_enrolment_df['Num_Enrolled'] = final_enrolment_df['Num_Enrolled'].apply(lambda x: pd.to_numeric(x))

In [54]:
# Transform data in Num_Enrolled column to reflect actual total (as current format was shortened ['000s])
final_enrolment_df['Num_Enrolled'] = final_enrolment_df['Num_Enrolled'].apply(lambda x: x*1000)
final_enrolment_df

    Region  Year  Num_Enrolled
0      NSW  2004      777700.0
1      NSW  2005      784400.0
2      NSW  2006      784400.0
3      NSW  2007      785600.0
4      NSW  2008      800500.0
..     ...   ...           ...
131    ACT  2016       62600.0
132    ACT  2017       63200.0
133    ACT  2018       71400.0
134    ACT  2019       61700.0
135    ACT  2020       59100.0

[136 rows x 3 columns]

In [55]:
final_enrolment_df['Region'].unique()

array(['NSW', 'VIC', 'QLD', 'SA', 'WA', 'TAS', 'NT', 'ACT'], dtype=object)